# IsBuiltInParameter Method (ForgeTypeId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterUtils..::..IsBuiltInParameter Method (ForgeTypeId)
ParameterUtils Class See Also
---
Checks whether a ForgeTypeId identifies a built-in parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static bool IsBuiltInParameter(
	ForgeTypeId parameterTypeId
)
```

Visual Basic
---
```text
Public Shared Function IsBuiltInParameter ( _
	parameterTypeId As ForgeTypeId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsBuiltInParameter(
	ForgeTypeId^ parameterTypeId
)
```

# ### Parameters
parameterTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId The identifier to check.
# ### Return Value
True if the ForgeTypeId identifies a built-in parameter, false otherwise.
# Remarks
A ForgeTypeId identifies a built-in parameter if it corresponds to a valid BuiltInParameter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ParameterUtils Class
IsBuiltInParameter Overload
Autodesk.Revit.DB Namespace